tap "gigalixir/brew"
tap "go-task/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "lucassabreu/tap"
tap "neovim/neovim"
tap "nextdns/tap"
tap "superfly/tap"
tap "tldr-pages/tldr"
tap "xwmx/taps"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf", args: ["HEAD"]
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Real-time data compression library
brew "lzo"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# C library implementing the SSH2 protocol
brew "libssh2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Command-line tool to interact with exercism.io
brew "exercism"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# XSL-FO print formatter for making PDF or PS documents
brew "fop"
# Multi-format archive and compression library
brew "libarchive"
# Configurable embedded Linux firmware update creator and runner
brew "fwup"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Open-source GitLab command-line tool
brew "glab"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Modular IRC client
brew "irssi"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# DNS library written in C
brew "ldns"
# CSS parsing and manipulation toolkit for GNOME
brew "libcroco"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# GNOME XML library
brew "libxml2"
# C XSLT library for GNOME
brew "libxslt"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# Generic syntax highlighter
brew "pygments"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Install various Ruby versions and implementations
brew "ruby-build"
# Safe, concurrent, practical language
brew "rust"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id", link: true
# Cross-shell prompt for astronauts
brew "starship"
# Strong open-source chess engine
brew "stockfish"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Batch system to run tasks one after another
brew "task-spooler"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Auto-hinter for TrueType fonts
brew "ttfautohint"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Cross-platform C++ GUI toolkit - Stable Release
brew "wxwidgets@3.0"
# Tool for managing your YubiKey configuration
brew "ykman"
# Plain text note-taking assistant
brew "zk"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Gigalixir CLI
brew "gigalixir/brew/gigalixir"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Packer
brew "hashicorp/tap/packer"
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer"
# Helps to interact with Clockfy's API
brew "lucassabreu/tap/clockify-cli"
brew "superfly/tap/flyctl"
# Simplified and community-driven man pages
brew "tldr-pages/tldr/tldr"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Status Bar app to keep the audio balance from drifting
cask "ballast"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
cask "etcher"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Monospaced font with cursive italics and programming symbol ligatures
cask "font-victor-mono"
# Open-source screen recorder built with web technology
cask "kap"
# Open-source keystroke visualizer
cask "keycastr"
# VPN client
cask "mullvadvpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# App that enables mouse-free UI interaction
cask "shortcat"
# Open-source code editor
cask "visual-studio-code"
# Mastodon, Pleroma, and Misskey client
cask "whalebird"
# Mind mapping and brainstorming tool
cask "xmind"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Cascadea", id: 1432182561
mas "Color Palette from Image", id: 950112142
mas "Dark Reader for Safari", id: 1438243180
mas "Deckset", id: 847496013
mas "Deliveries", id: 924726344
mas "GarageBand", id: 682658836
mas "Hush", id: 1544743900
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Keynote", id: 409183694
mas "LimeChat", id: 414030210
mas "Mimeo Photos", id: 1282504627
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pages", id: 409201541
mas "Paprika Recipe Manager", id: 451907568
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pixelmator", id: 407963104
mas "Sasquatch", id: 1465346522
mas "Session", id: 1521432881
mas "Shush", id: 496437906
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "Throttle", id: 1482466653
mas "Type Fu", id: 509818877
mas "Type to Learn", id: 1401007562
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
