tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "ms-jpq/sad"
tap "remotemobprogramming/brew"
# Library and utilities for processing GIFs
brew "giflib"
# Library for manipulating PNG images
brew "libpng"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Vector graphics library with cross-device output support
brew "cairo"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Asynchronous event library
brew "libevent"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Assuan IPC Library
brew "libassuan"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Version Control Visualization Tool
brew "gource"
# Tool for glamorous shell scripts
brew "gum"
# OpenType text shaping engine
brew "harfbuzz"
# Easy, fast, and beautiful database client for the terminal
brew "harlequin"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Portable Foreign Function Interface library
brew "libffi"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# YAML Parser
brew "libyaml"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# QUIC transport protocol implementation
brew "mvfst"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Control nvim processes using `nvr` command-line tool
brew "neovim-remote"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Plain text note-taking assistant
brew "zk"
# General-purpose lossless data-compression library
brew "zlib"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Search and replace | Space Age seD
brew "ms-jpq/sad/sad"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-victor-mono-nerd-font"
# Client for the Google Drive storage service
cask "google-drive"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# App that enables mouse-free UI interaction
cask "shortcat"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Hand Mirror", id: 1502839586
mas "Hush", id: 1544743900
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Postico", id: 6446933691
mas "Raycast Companion", id: 6738274497
mas "Session", id: 1521432881
mas "Vimari", id: 1480933944
