tap "gigalixir/brew"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "neovim/neovim"
tap "superfly/tap"
tap "tldr-pages/tldr"
tap "xwmx/taps"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# TAP-compliant test framework for Bash scripts
brew "bats"
# Collection of portable C++ source libraries
brew "boost"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Real-time data compression library
brew "lzo"
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Distributed search & analytics engine
brew "elasticsearch", restart_service: true
# Command-line tool to interact with exercism.io
brew "exercism"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Configurable embedded Linux firmware update creator and runner
brew "fwup"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# HTTP/2 C Library
brew "nghttp2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Configurable static site generator
brew "hugo"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Modular IRC client
brew "irssi"
# Network authentication protocol
brew "krb5"
# DNS library written in C
brew "ldns"
# CSS parsing and manipulation toolkit for GNOME
brew "libcroco"
# Library to render SVG files using Cairo
brew "librsvg"
# GNOME XML library
brew "libxml2"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# High performance, distributed memory object caching system
brew "memcached"
# Open source relational database management system
brew "mysql@5.7"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install various Ruby versions and implementations
brew "ruby-build"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id", link: true
# Strong open-source chess engine
brew "stockfish"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Batch system to run tasks one after another
brew "task-spooler"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Auto-hinter for TrueType fonts
brew "ttfautohint"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Tool for managing your YubiKey configuration
brew "ykman"
# General-purpose lossless data-compression library
brew "zlib"
# Fast static site generator in a single binary with everything built-in
brew "zola"
# UNIX shell (command interpreter)
brew "zsh"
# Gigalixir CLI
brew "gigalixir/brew/gigalixir"
# Packer
brew "hashicorp/tap/packer"
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer"
brew "superfly/tap/flyctl"
# Simplified and community-driven man pages
brew "tldr-pages/tldr/tldr"
brew "xwmx/taps/nb"
# Status Bar app to keep the audio balance from drifting
cask "ballast"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
cask "etcher"
cask "font-hack-nerd-font"
cask "font-victor-mono"
# Open-source keystroke visualizer
cask "keycastr"
# Open-source code editor
cask "visual-studio-code"
# Mastodon, Pleroma and Misskey client
cask "whalebird"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "2048 Game", id: 871033113
mas "AdGuard for Safari", id: 1440147259
mas "Butter Royale", id: 1464649839
mas "Color Palette from Image", id: 950112142
mas "Dark Reader for Safari", id: 1438243180
mas "Deckset", id: 847496013
mas "Deliveries", id: 924726344
mas "GarageBand", id: 682658836
mas "GIPHY CAPTURE", id: 668208984
mas "iMovie", id: 408981434
mas "Ka-Block!", id: 1335413823
mas "Keynote", id: 409183694
mas "Mimeo Photos", id: 1282504627
mas "Mini Motorways", id: 1456188526
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Owly", id: 882812218
mas "Pages", id: 409201541
mas "Paprika Recipe Manager", id: 451907568
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pixelmator", id: 407963104
mas "Sasquatch", id: 1465346522
mas "Shush", id: 496437906
mas "Slack", id: 803453959
mas "Tabs Saver for Safari", id: 1440006971
mas "Telegram", id: 747648890
mas "TheOregonTrail", id: 1502228492
mas "Throttle", id: 1482466653
mas "Toggl Track", id: 957734279
mas "Type Fu", id: 509818877
mas "Type to Learn", id: 1401007562
mas "Xcode", id: 497799835
